Revit 2027 API
BuiltInFailures.GlobalParameterFailures.GlobalParamInvalidElemParamValue Property
 Invalid value of parameter %1!s! in highlighted element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GlobalParamInvalidElemParamValue { get; }
Public Shared ReadOnly Property GlobalParamInvalidElemParamValue As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GlobalParamInvalidElemParamValue {
	FailureDefinitionId^ get ();
}
static member GlobalParamInvalidElemParamValue : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GlobalParameterFailures Class
Autodesk.Revit.DB Namespace